{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"Megan_Fox","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Megan_Fox","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"Mila_Kunis","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Mila_Kunis","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"Amanda_Seyfried","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Amanda_Seyfried","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"Hayden_Panettiere","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Hayden_Panettiere","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"Missy_Peregrym","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Missy_Peregrym","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"Rachel_McAdams","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Rachel_McAdams","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["Megan_Fox",0,0,{}],["Mila_Kunis",0,0,{}],["Amanda_Seyfried",0,0,{}],["Hayden_Panettiere",0,0,{}],["Missy_Peregrym",0,0,{}],["Rachel_McAdams",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0],["input4",0,0],["input5",0,0],["input6",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./myClassifierModel01.weights.bin"],"weights":[{"name":"Megan_Fox/kernel","shape":[1,136],"dtype":"float32"},{"name":"Megan_Fox/bias","shape":[136],"dtype":"float32"},{"name":"Mila_Kunis/kernel","shape":[1,136],"dtype":"float32"},{"name":"Mila_Kunis/bias","shape":[136],"dtype":"float32"},{"name":"Amanda_Seyfried/kernel","shape":[1,136],"dtype":"float32"},{"name":"Amanda_Seyfried/bias","shape":[136],"dtype":"float32"},{"name":"Hayden_Panettiere/kernel","shape":[1,136],"dtype":"float32"},{"name":"Hayden_Panettiere/bias","shape":[136],"dtype":"float32"},{"name":"Missy_Peregrym/kernel","shape":[1,136],"dtype":"float32"},{"name":"Missy_Peregrym/bias","shape":[136],"dtype":"float32"},{"name":"Rachel_McAdams/kernel","shape":[1,136],"dtype":"float32"},{"name":"Rachel_McAdams/bias","shape":[136],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[816,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}