{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"Joe_Smith","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Joe_Smith","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"sdfsdf","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"sdfsdf","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"sdfsdfasdf","class_name":"Dense","config":{"units":136,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"sdfsdfasdf","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["Joe_Smith",0,0,{}],["sdfsdf",0,0,{}],["sdfsdfasdf",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input4",0,0],["input5",0,0],["input6",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./myClassifierModel01.weights.bin"],"weights":[{"name":"Joe_Smith/kernel","shape":[8,136],"dtype":"float32"},{"name":"Joe_Smith/bias","shape":[136],"dtype":"float32"},{"name":"sdfsdf/kernel","shape":[4,136],"dtype":"float32"},{"name":"sdfsdf/bias","shape":[136],"dtype":"float32"},{"name":"sdfsdfasdf/kernel","shape":[2,136],"dtype":"float32"},{"name":"sdfsdfasdf/bias","shape":[136],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[408,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}